1042.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-07-23 周日 14:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb148f8f">1. 1042</a>
<ul>
<li><a href="#orga29f0ec">1.1. problem</a></li>
<li><a href="#org8c3b580">1.2. solution</a>
<ul>
<li><a href="#org3395271">1.2.1. scratch</a></li>
<li><a href="#orgccd8176">1.2.2. thinking</a></li>
<li><a href="#org7416ce7">1.2.3. code</a></li>
<li><a href="#org4ffdc42">1.2.4. input sample</a></li>
<li><a href="#org38c321b">1.2.5. output sample</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgb148f8f" class="outline-2">
<h2 id="orgb148f8f"><span class="section-number-2">1</span> 1042</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orga29f0ec" class="outline-3">
<h3 id="orga29f0ec"><span class="section-number-3">1.1</span> problem</h3>
<div class="outline-text-3" id="text-1-1">
<p>
John want to finsh in n lakes: (1&lt;n&lt;26)
John has h (0&lt;h&lt;17)available hours. 
from lake i too lake i+1 time interval ti (0&lt;ti&lt;193)
lake i : first 5-minutes fi (fi&gt;=0), next 5-minutes decrease di (di&gt;=0)
</p>

<p>
give the finshing plan which make John get max number of finsh.
</p>
</div>
</div>


<div id="outline-container-org8c3b580" class="outline-3">
<h3 id="org8c3b580"><span class="section-number-3">1.2</span> solution</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-org3395271" class="outline-4">
<h4 id="org3395271"><span class="section-number-4">1.2.1</span> scratch</h4>
<div class="outline-text-4" id="text-1-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">n</th>
<th scope="col" class="org-right">4</th>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-right">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">h</td>
<td class="org-right">4</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">fi</td>
<td class="org-right">10</td>
<td class="org-right">15</td>
<td class="org-right">50</td>
<td class="org-right">30</td>
</tr>

<tr>
<td class="org-left">di</td>
<td class="org-right">0</td>
<td class="org-right">3</td>
<td class="org-right">4</td>
<td class="org-right">3</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">ti</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>




<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">left h:</td>
<td class="org-right">4*12=48</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">first-5-min:(F5M)</td>
<td class="org-right">10</td>
<td class="org-right">15</td>
<td class="org-right">50</td>
<td class="org-right">30</td>
</tr>

<tr>
<td class="org-left">can-fish-interval:(CFI)</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">4</td>
<td class="org-right">7</td>
</tr>

<tr>
<td class="org-left">current<sub>fish</sub><sub>time</sub>:(CFT)</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>
</tbody>
</table>

<p>
one iterate:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">left h:</td>
<td class="org-right">4*12=48 - 4</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">first-5-min:(F5M)</td>
<td class="org-right">10</td>
<td class="org-right">15</td>
<td class="org-right">46</td>
<td class="org-right">30</td>
</tr>

<tr>
<td class="org-left">can-fish-interval:(CFI)</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">7</td>
</tr>

<tr>
<td class="org-left">current<sub>fish</sub><sub>time</sub>:(CFT)</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
</tr>
</tbody>
</table>

<p>
total<sub>fish</sub>=0
while: left<sub>h</sub>&gt;0
find lake to finsh: select<sub>i</sub> = max {f(i)}, f(i)=f(j) -&gt; min(i,j) 
</p>

<p>
f(i) = F5M[i] / CFI[i] ,0&lt;=i&lt;n and CFI[i]&lt;=left<sub>h</sub>  
</p>

<p>
##### here has some bugs. #######
</p>

<p>
total<sub>fish</sub> += F5M[select<sub>i</sub>]
</p>

<p>
F5M[select<sub>i</sub>] -= d[select<sub>i</sub>]
</p>

<p>
CFT[select<sub>i</sub>] += 1
</p>

<p>
left h: left<sub>h</sub> - CFI[select<sub>i</sub>]
</p>

<p>
update CFI[j] = select<sub>i</sub>, j&lt;=i 
</p>
</div>
</div>

<div id="outline-container-orgccd8176" class="outline-4">
<h4 id="orgccd8176"><span class="section-number-4">1.2.2</span> thinking</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
for every step: select a lake to fish for the current 5-minutes, by the CFI, F5M, left<sub>h</sub>
</p>

<p>
the corrent dp solution:
</p>

<p>
dp[i][j] represent first i lakes and first j time can get max number
of fish:
dp[i+1][j+t[i+1]+k] = max(dp[i][j]+sum<sub>k</sub>, dp[i+1][j+t[i+1]+k]);
</p>

<p>
sum<sub>k</sub> = f[i][k] + f[i][k-1] + &#x2026; + f[i][0], f[i][k]: lake<sub>i</sub> kth fish the number of fish
</p>


<p>
t[i+1] = interval(lake<sub>i</sub> &#x2013;&gt; lake<sub>(i+1)</sub>)
</p>
</div>
</div>

<div id="outline-container-org7416ce7" class="outline-4">
<h4 id="org7416ce7"><span class="section-number-4">1.2.3</span> code</h4>
<div class="outline-text-4" id="text-1-2-3">
<div class="org-src-container">
<pre class="src src-c++">#include&lt;stdio.h&gt;
#include&lt;string.h&gt;

int max(int a, int b) {
  return a&gt;b? a:b;
}



int main() {

  // freopen("fish_in.txt", "r", stdin);

  // define
  int dp[30][400]; // first i lakes first j times max fish
  int f[30][400];
  int t[30];
  int d[30];
  int n, h;

  // input
  while(scanf("%d", &amp;n) &amp;&amp; n) {
    scanf("%d", &amp;h);
    h *= 12;

    memset(f, 0, sizeof(f));
    for (int i=1; i&lt;=n; i++) {
      scanf("%d", &amp;f[i][1]);
    }

    for (int i=1; i&lt;=n; i++) {
      scanf("%d", &amp;d[i]);
    }

    for (int i=2; i&lt;=n; i++) {
      scanf("%d", &amp;t[i]);
    }
    t[1] = 0;

    for (int i=1; i&lt;=n; i++) {
      for (int j=2; j&lt;=h; j++) {
	if (f[i][j-1] &lt; d[i]) break;
	f[i][j] = f[i][j-1] - d[i];
      }
    }

    memset(dp, -1, sizeof(dp));
    dp[0][0]=0;
    // dp
    for (int i=0; i&lt;n; i++) {
      for (int j=0; j&lt;=h; j++) {
	// lake i, time j, interval k
	int sum = 0;
	for (int k=0; k&lt;=h &amp;&amp; dp[i][j]!=-1; k++) {
	  if (j+t[i+1]+k&gt;h) break;
	  dp[i+1][j+t[i+1]+k] = max(dp[i+1][j+t[i+1]+k], dp[i][j]+sum);
	  if(f[i+1][k+1]&gt;0) sum += f[i+1][k+1];
	}
      }
    }
    // result
    int last = 1;
    int max_fish = 0;
    for (int i=1; i&lt;=n; i++) {
      if (dp[i][h] &gt; max_fish) {
	max_fish = dp[i][h];
	last = i;
      }
    }

    // result time
    int max_fish_copy = max_fish;
    for (int i=last; i&gt;=2; i--) {
      int j, sum = 0;
      for (j=0; j&lt;=h; j++) {
	if (max_fish_copy == sum + (dp[i-1][h-t[i]-j])) {
	  f[i][0] = j;
	  break;
	}
	sum += f[i][j+1];
      }

      h = h-t[i]-j;
      max_fish_copy -= sum;
    }

    f[1][0] = h;

    // output

    for (int i=1; i&lt;n; i++) {
      printf("%d, ", f[i][0]*5);
    }
    printf("%d\n", f[n][0]*5);

    printf("Number of fish expected: %d \n\n", max_fish);

  }


  return 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org4ffdc42" class="outline-4">
<h4 id="org4ffdc42"><span class="section-number-4">1.2.4</span> input sample</h4>
<div class="outline-text-4" id="text-1-2-4">
<pre class="example">
2 
1 
10 1 
2 5 
2 
4 
4 
10 15 20 17 
0 3 4 3 
1 2 3 
4 
4 
10 15 50 30 
0 3 4 3 
1 2 3 
0 
</pre>
</div>
</div>

<div id="outline-container-org38c321b" class="outline-4">
<h4 id="org38c321b"><span class="section-number-4">1.2.5</span> output sample</h4>
<div class="outline-text-4" id="text-1-2-5">
<pre class="example">
45, 5 
Number of fish expected: 31 

240, 0, 0, 0 
Number of fish expected: 480 

115, 10, 50, 35 
Number of fish expected: 724 
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-07-23 周日 14:17</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
